turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS2A.atdf
        <register name="PDERS" offset="0x84" rw="W" size="4" access-size="4" atomic-op="set:PDER" caption="Pull-down Enable Register - Set">
          <bitfield name="P0" caption="Pull-down Enable" mask="0x1"/>
          <bitfield name="P1" caption="Pull-down Enable" mask="0x2"/>
          <bitfield name="P2" caption="Pull-down Enable" mask="0x4"/>
          <bitfield name="P3" caption="Pull-down Enable" mask="0x8"/>
          <bitfield name="P4" caption="Pull-down Enable" mask="0x10"/>
          <bitfield name="P5" caption="Pull-down Enable" mask="0x20"/>
          <bitfield name="P6" caption="Pull-down Enable" mask="0x40"/>
          <bitfield name="P7" caption="Pull-down Enable" mask="0x80"/>
          <bitfield name="P8" caption="Pull-down Enable" mask="0x100"/>
          <bitfield name="P9" caption="Pull-down Enable" mask="0x200"/>
          <bitfield name="P10" caption="Pull-down Enable" mask="0x400"/>
          <bitfield name="P11" caption="Pull-down Enable" mask="0x800"/>
          <bitfield name="P12" caption="Pull-down Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Pull-down Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Pull-down Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Pull-down Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Pull-down Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Pull-down Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Pull-down Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Pull-down Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Pull-down Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Pull-down Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Pull-down Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Pull-down Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Pull-down Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Pull-down Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Pull-down Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Pull-down Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Pull-down Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Pull-down Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Pull-down Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Pull-down Enable" mask="0x80000000"/>
        </register>
        <register name="PDERC" offset="0x88" rw="W" size="4" access-size="4" atomic-op="clear:PDER" caption="Pull-down Enable Register - Clear">
          <bitfield name="P0" caption="Pull-down Enable" mask="0x1"/>
          <bitfield name="P1" caption="Pull-down Enable" mask="0x2"/>
          <bitfield name="P2" caption="Pull-down Enable" mask="0x4"/>
          <bitfield name="P3" caption="Pull-down Enable" mask="0x8"/>
          <bitfield name="P4" caption="Pull-down Enable" mask="0x10"/>
          <bitfield name="P5" caption="Pull-down Enable" mask="0x20"/>
          <bitfield name="P6" caption="Pull-down Enable" mask="0x40"/>
          <bitfield name="P7" caption="Pull-down Enable" mask="0x80"/>
          <bitfield name="P8" caption="Pull-down Enable" mask="0x100"/>
          <bitfield name="P9" caption="Pull-down Enable" mask="0x200"/>
          <bitfield name="P10" caption="Pull-down Enable" mask="0x400"/>
          <bitfield name="P11" caption="Pull-down Enable" mask="0x800"/>
          <bitfield name="P12" caption="Pull-down Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Pull-down Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Pull-down Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Pull-down Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Pull-down Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Pull-down Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Pull-down Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Pull-down Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Pull-down Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Pull-down Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Pull-down Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Pull-down Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Pull-down Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Pull-down Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Pull-down Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Pull-down Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Pull-down Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Pull-down Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Pull-down Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Pull-down Enable" mask="0x80000000"/>
        </register>
        <register name="PDERT" offset="0x8C" rw="W" size="4" access-size="4" atomic-op="toggle:PDER" caption="Pull-down Enable Register - Toggle">
          <bitfield name="P0" caption="Pull-down Enable" mask="0x1"/>
          <bitfield name="P1" caption="Pull-down Enable" mask="0x2"/>
          <bitfield name="P2" caption="Pull-down Enable" mask="0x4"/>
          <bitfield name="P3" caption="Pull-down Enable" mask="0x8"/>
          <bitfield name="P4" caption="Pull-down Enable" mask="0x10"/>
          <bitfield name="P5" caption="Pull-down Enable" mask="0x20"/>
          <bitfield name="P6" caption="Pull-down Enable" mask="0x40"/>
          <bitfield name="P7" caption="Pull-down Enable" mask="0x80"/>
          <bitfield name="P8" caption="Pull-down Enable" mask="0x100"/>
          <bitfield name="P9" caption="Pull-down Enable" mask="0x200"/>
          <bitfield name="P10" caption="Pull-down Enable" mask="0x400"/>
          <bitfield name="P11" caption="Pull-down Enable" mask="0x800"/>
          <bitfield name="P12" caption="Pull-down Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Pull-down Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Pull-down Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Pull-down Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Pull-down Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Pull-down Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Pull-down Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Pull-down Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Pull-down Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Pull-down Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Pull-down Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Pull-down Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Pull-down Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Pull-down Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Pull-down Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Pull-down Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Pull-down Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Pull-down Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Pull-down Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Pull-down Enable" mask="0x80000000"/>
        </register>
        <register name="IER" offset="0x90" rw="RW" size="4" access-size="4" caption="Interrupt Enable Register">
          <bitfield name="P0" caption="Interrupt Enable" mask="0x1"/>
          <bitfield name="P1" caption="Interrupt Enable" mask="0x2"/>
          <bitfield name="P2" caption="Interrupt Enable" mask="0x4"/>
          <bitfield name="P3" caption="Interrupt Enable" mask="0x8"/>
          <bitfield name="P4" caption="Interrupt Enable" mask="0x10"/>
          <bitfield name="P5" caption="Interrupt Enable" mask="0x20"/>
          <bitfield name="P6" caption="Interrupt Enable" mask="0x40"/>
          <bitfield name="P7" caption="Interrupt Enable" mask="0x80"/>
          <bitfield name="P8" caption="Interrupt Enable" mask="0x100"/>
          <bitfield name="P9" caption="Interrupt Enable" mask="0x200"/>
          <bitfield name="P10" caption="Interrupt Enable" mask="0x400"/>
          <bitfield name="P11" caption="Interrupt Enable" mask="0x800"/>
          <bitfield name="P12" caption="Interrupt Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Interrupt Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Interrupt Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Interrupt Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Interrupt Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Interrupt Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Interrupt Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Interrupt Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Interrupt Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Interrupt Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Interrupt Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Interrupt Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Interrupt Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Interrupt Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Interrupt Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Interrupt Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Interrupt Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Interrupt Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Interrupt Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Interrupt Enable" mask="0x80000000"/>
        </register>
        <register name="IERS" offset="0x94" rw="W" size="4" access-size="4" atomic-op="set:IER" caption="Interrupt Enable Register - Set">
          <bitfield name="P0" caption="Interrupt Enable" mask="0x1"/>
          <bitfield name="P1" caption="Interrupt Enable" mask="0x2"/>
          <bitfield name="P2" caption="Interrupt Enable" mask="0x4"/>
          <bitfield name="P3" caption="Interrupt Enable" mask="0x8"/>
          <bitfield name="P4" caption="Interrupt Enable" mask="0x10"/>
          <bitfield name="P5" caption="Interrupt Enable" mask="0x20"/>
          <bitfield name="P6" caption="Interrupt Enable" mask="0x40"/>
          <bitfield name="P7" caption="Interrupt Enable" mask="0x80"/>
          <bitfield name="P8" caption="Interrupt Enable" mask="0x100"/>
          <bitfield name="P9" caption="Interrupt Enable" mask="0x200"/>
          <bitfield name="P10" caption="Interrupt Enable" mask="0x400"/>
          <bitfield name="P11" caption="Interrupt Enable" mask="0x800"/>
          <bitfield name="P12" caption="Interrupt Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Interrupt Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Interrupt Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Interrupt Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Interrupt Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Interrupt Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Interrupt Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Interrupt Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Interrupt Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Interrupt Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Interrupt Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Interrupt Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Interrupt Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Interrupt Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Interrupt Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Interrupt Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Interrupt Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Interrupt Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Interrupt Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Interrupt Enable" mask="0x80000000"/>
        </register>
        <register name="IERC" offset="0x98" rw="W" size="4" access-size="4" atomic-op="clear:IER" caption="Interrupt Enable Register - Clear">
          <bitfield name="P0" caption="Interrupt Enable" mask="0x1"/>
          <bitfield name="P1" caption="Interrupt Enable" mask="0x2"/>
          <bitfield name="P2" caption="Interrupt Enable" mask="0x4"/>
          <bitfield name="P3" caption="Interrupt Enable" mask="0x8"/>
          <bitfield name="P4" caption="Interrupt Enable" mask="0x10"/>
          <bitfield name="P5" caption="Interrupt Enable" mask="0x20"/>
          <bitfield name="P6" caption="Interrupt Enable" mask="0x40"/>
          <bitfield name="P7" caption="Interrupt Enable" mask="0x80"/>
          <bitfield name="P8" caption="Interrupt Enable" mask="0x100"/>
          <bitfield name="P9" caption="Interrupt Enable" mask="0x200"/>
          <bitfield name="P10" caption="Interrupt Enable" mask="0x400"/>
          <bitfield name="P11" caption="Interrupt Enable" mask="0x800"/>
          <bitfield name="P12" caption="Interrupt Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Interrupt Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Interrupt Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Interrupt Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Interrupt Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Interrupt Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Interrupt Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Interrupt Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Interrupt Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Interrupt Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Interrupt Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Interrupt Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Interrupt Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Interrupt Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Interrupt Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Interrupt Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Interrupt Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Interrupt Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Interrupt Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Interrupt Enable" mask="0x80000000"/>
        </register>
