turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS2A.atdf
        <register name="THR" offset="0x24" rw="W" size="4" access-size="4" caption="Transmit Holding Register">
          <bitfield name="TDAT" caption="Transmit Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="VERSION" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000100" caption="Version Register">
          <bitfield name="VERSION" caption="Reserved. Value subject to change. No functionality associated. This is the Atmel internal version of the macrocell." mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Reserved. Value subject to change. No functionality associated." mask="0xF0000"/>
        </register>
        <register name="PARAMETER" offset="0x2C" rw="R" size="4" access-size="4" initval="0x00010000" caption="Parameter Register">
          <bitfield name="FORMAT" caption="Data protocol format" mask="0x80" values="IISC_PARAMETER__FORMAT"/>
          <bitfield name="NBCHAN" caption="Maximum number of channels - 1" mask="0x1F0000"/>
        </register>
      </register-group>
      <value-group name="IISC_CR__CKDIS">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables clocks" value="1"/>
      </value-group>
      <value-group name="IISC_CR__CKEN">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables clocks if CKDIS is not set" value="1"/>
      </value-group>
      <value-group name="IISC_CR__RXDIS">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables Data Receive" value="1"/>
      </value-group>
      <value-group name="IISC_CR__RXEN">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables Data Receive if RXDIS is not set" value="1"/>
      </value-group>
      <value-group name="IISC_CR__SWRST">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Performs a software reset. Has priority on any other bit in CR" value="1"/>
      </value-group>
      <value-group name="IISC_CR__TXDIS">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables Data Transmit" value="1"/>
      </value-group>
      <value-group name="IISC_CR__TXEN">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables Data Transmit if TXDIS is not set" value="1"/>
      </value-group>
      <value-group name="IISC_MR__DATALENGTH">
        <value name="32" caption="32 bits" value="0"/>
        <value name="24" caption="24 bits" value="1"/>
        <value name="20" caption="20 bits" value="2"/>
        <value name="18" caption="18 bits" value="3"/>
        <value name="16" caption="16 bits" value="4"/>
        <value name="16C" caption="16 bits compact stereo" value="5"/>
        <value name="8" caption="8 bits" value="6"/>
        <value name="8C" caption="8 bits compact stereo" value="7"/>
      </value-group>
      <value-group name="IISC_MR__IMCKFS">
        <value name="16" caption="16 fs" value="0"/>
        <value name="32" caption="32 fs" value="1"/>
        <value name="64" caption="64 fs" value="3"/>
        <value name="128" caption="128 fs" value="7"/>
        <value name="256" caption="256 fs" value="15"/>
        <value name="384" caption="384 fs" value="23"/>
        <value name="512" caption="512 fs" value="31"/>
        <value name="768" caption="768 fs" value="47"/>
        <value name="1024" caption="1024 fs" value="63"/>
      </value-group>
      <value-group name="IISC_MR__IMCKMODE">
        <value name="NO_IMCK" caption="No IMCK generated" value="0"/>
        <value name="IMCK" caption="IMCK generated" value="1"/>
      </value-group>
      <value-group name="IISC_MR__IWS24">
        <value name="32" caption="IWS Data Slot is 32-bit wide for DATALENGTH=18/20/24-bit" value="0"/>
        <value name="24" caption="IWS Data Slot is 24-bit wide for DATALENGTH=18/20/24-bit" value="1"/>
      </value-group>
      <value-group name="IISC_MR__MODE">
        <value name="SLAVE" caption="Slave mode (only serial data handled, clocks received from external master or controller)" value="0"/>
        <value name="MASTER" caption="Master mode (clocks generated and output by IISC, serial data handled if CR.RXEN and/or CR.TXEN written to 1)" value="1"/>
      </value-group>
      <value-group name="IISC_MR__RXDMA">
        <value name="SINGLE" caption="Single DMA channel" value="0"/>
        <value name="MULTIPLE" caption="One DMA channel per data channel" value="1"/>
      </value-group>
      <value-group name="IISC_MR__RXLOOP">
        <value name="OFF" caption="Normal mode" value="0"/>
        <value name="ON" caption="ISDO internally connected to ISDI" value="1"/>
      </value-group>
      <value-group name="IISC_MR__RXMONO">
        <value name="STEREO" caption="Normal mode" value="0"/>
        <value name="MONO" caption="Left channel data is duplicated to right channel" value="1"/>
      </value-group>
      <value-group name="IISC_MR__TXDMA">
        <value name="SINGLE" caption="Single DMA channel" value="0"/>
        <value name="MULTIPLE" caption="One DMA channel per data channel" value="1"/>
      </value-group>
      <value-group name="IISC_MR__TXMONO">
        <value name="STEREO" caption="Normal mode" value="0"/>
        <value name="MONO" caption="Left channel data is duplicated to right channel" value="1"/>
      </value-group>
      <value-group name="IISC_MR__TXSAME">
        <value name="ZERO" caption="Zero data transmitted in case of underrun" value="0"/>
        <value name="SAME" caption="Last data transmitted in case of underrun" value="1"/>
      </value-group>
      <value-group name="IISC_SR__RXEN">
        <value name="OFF" caption="Receiver is effectively disabled, following a CR.RXDIS or CR.SWRST request" value="0"/>
        <value name="ON" caption="Receiver is effectively enabled, following a CR.RXEN request" value="1"/>
      </value-group>
      <value-group name="IISC_SR__RXOR">
        <value name="NO" caption="No overrun" value="0"/>
        <value name="YES" caption="The previous received data has not been read. This data is lost" value="1"/>
      </value-group>
      <value-group name="IISC_SR__RXORCH">
        <value name="LEFT" caption="Overrun first occurred on left channel" value="0"/>
        <value name="RIGHT" caption="Overrun first occurred on right channel" value="1"/>
      </value-group>
      <value-group name="IISC_SR__RXRDY">
        <value name="EMPTY" caption="The register RHR is empty and can't be read" value="0"/>
        <value name="FULL" caption="The register RHR is full and is ready to be read" value="1"/>
      </value-group>
      <value-group name="IISC_SR__TXEN">
        <value name="OFF" caption="Transmitter is effectively disabled, following a CR.TXDIS or CR.SWRST request" value="0"/>
        <value name="ON" caption="Transmitter is effectively enabled, following a CR.TXEN request" value="1"/>
      </value-group>
      <value-group name="IISC_SR__TXRDY">
        <value name="FULL" caption="The register THR is full and can't be written" value="0"/>
        <value name="EMPTY" caption="The register THR is empty and is ready to be written" value="1"/>
      </value-group>
