turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS2A.atdf
      <value-group name="IISC_SR__TXUR">
        <value name="NO" caption="No underrun" value="0"/>
        <value name="YES" caption="The last bit of the last data written to the register THR has been set. Until the next write to THR, data will be sent according to MR.TXSAME field" value="1"/>
      </value-group>
      <value-group name="IISC_SR__TXURCH">
        <value name="LEFT" caption="Underrun first occurred on left channel" value="0"/>
        <value name="RIGHT" caption="Underrun first occurred on right channel" value="1"/>
      </value-group>
      <value-group name="IISC_SCR__RXOR">
        <value name="NO" caption="No effect" value="0"/>
        <value name="CLEAR" caption="Clears the corresponding SR bit" value="1"/>
      </value-group>
      <value-group name="IISC_SCR__TXUR">
        <value name="NO" caption="No effect" value="0"/>
        <value name="CLEAR" caption="Clears the corresponding SR bit" value="1"/>
      </value-group>
      <value-group name="IISC_SSR__RXOR">
        <value name="NO" caption="No effect" value="0"/>
        <value name="SET" caption="Sets corresponding SR bit" value="1"/>
      </value-group>
      <value-group name="IISC_SSR__TXUR">
        <value name="NO" caption="No effect" value="0"/>
        <value name="SET" caption="Sets corresponding SR bit" value="1"/>
      </value-group>
      <value-group name="IISC_IER__RXOR">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IER__RXRDY">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IER__TXRDY">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IER__TXUR">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IDR__RXOR">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IDR__RXRDY">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IDR__TXRDY">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IDR__TXUR">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IMR__RXOR">
        <value name="DISABLED" caption="The corresponding interrupt is disabled" value="0"/>
        <value name="ENABLED" caption="The corresponding interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="IISC_IMR__RXRDY">
        <value name="DISABLED" caption="The corresponding interrupt is disabled" value="0"/>
        <value name="ENABLED" caption="The corresponding interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="IISC_IMR__TXRDY">
        <value name="DISABLED" caption="The corresponding interrupt is disabled" value="0"/>
        <value name="ENABLED" caption="The corresponding interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="IISC_IMR__TXUR">
        <value name="DISABLED" caption="The corresponding interrupt is disabled" value="0"/>
        <value name="ENABLED" caption="The corresponding interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="IISC_PARAMETER__FORMAT">
        <value name="I2S" caption="I2S format, stereo with IWS low for left channel" value="0"/>
      </value-group>
    </module>
    <module name="PARC" id="I7570" version="1.0.0" caption="Parallel Capture">
      <register-group name="PARC" caption="Parallel Capture">
        <register name="CFG" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Configuration Register">
          <bitfield name="DSIZE" caption="Data Size" mask="0x3"/>
          <bitfield name="SMODE" caption="Sampling Mode" mask="0xC"/>
          <bitfield name="EMODE" caption="Events Mode" mask="0x10"/>
          <bitfield name="EDGE" caption="Sampling Edge Select" mask="0x20"/>
          <bitfield name="HALF" caption="Half Capture" mask="0x40"/>
          <bitfield name="ODD" caption="Odd Capture" mask="0x80"/>
        </register>
        <register name="CR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="DIS" caption="Disable" mask="0x2"/>
          <bitfield name="START" caption="Start Capture" mask="0x4"/>
          <bitfield name="STOP" caption="Stop Capture" mask="0x8"/>
        </register>
        <register name="IER" offset="0x8" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Enable" mask="0x8"/>
        </register>
        <register name="IDR" offset="0xC" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Disable" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Disable" mask="0x8"/>
        </register>
        <register name="IMR" offset="0x10" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Mask" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Mask" mask="0x8"/>
        </register>
        <register name="SR" offset="0x14" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="EN" caption="Enable Status" mask="0x1"/>
          <bitfield name="CS" caption="Capture Status" mask="0x2"/>
          <bitfield name="DRDY" caption="Data Ready Interrupt Status" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Status" mask="0x8"/>
        </register>
        <register name="ICR" offset="0x18" rw="W" size="4" access-size="4" atomic-op="clear:SR" initval="0x00000000" caption="Interrupt Status Clear Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Status Clear" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Status Clear" mask="0x8"/>
        </register>
        <register name="RHR" offset="0x1C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Receive Holding Register">
          <bitfield name="CDATA" caption="Captured Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="VERSION" offset="0x20" rw="R" size="4" access-size="4" initval="0x00000100" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="PDCA" id="I7514" version="1.2.4" caption="Peripheral DMA Controller">
      <register-group name="channel" size="0x40">
        <register name="MAR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Memory Address Register">
          <bitfield name="MADDR" caption="Memory Address" mask="0xFFFFFFFF"/>
        </register>
