turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS2A.atdf
      <value-group name="USART_CSR__UNRE">
        <value name="0" caption="No SPI underrun error has occurred since the last RSTSTA" value="0"/>
        <value name="1" caption="At least one SPI underrun error has occurred since the last RSTSTA" value="1"/>
      </value-group>
      <value-group name="USART_CSR__MANERR">
        <value name="0" caption="No Manchester error has been detected since the last RSTSTA" value="0"/>
        <value name="1" caption="At least one Manchester error has been detected since the last RSTSTA" value="1"/>
      </value-group>
      <value-group name="USART_RHR__RXSYNH">
        <value name="0" caption="Last character received is a Data" value="0"/>
        <value name="1" caption="Last character received is a Command" value="1"/>
      </value-group>
      <value-group name="USART_THR__TXSYNH">
        <value name="0" caption="The next character sent is encoded as a data. Start Frame Delimiter is DATA SYNC" value="0"/>
        <value name="1" caption="The next character sent is encoded as a command. Start Frame Delimiter is COMMAND SYNC" value="1"/>
      </value-group>
      <value-group name="USART_BRGR__CD">
        <value name="DISABLE" caption="Disables the clock" value="0"/>
        <value name="BYPASS" caption="Clock Divisor Bypass" value="1"/>
        <value name="2" caption="Baud Rate (Asynchronous Mode) = Selected Clock/(16 x CD) or (8 x CD); Baud Rate (Synchronous Mode) = Selected Clock/CD;" value="2"/>
      </value-group>
      <value-group name="USART_BRGR__FP">
        <value name="0" caption="Fractional divider is disabled" value="0"/>
      </value-group>
      <value-group name="USART_RTOR__TO">
        <value name="DISABLE" caption="Disables the RX Time-out function" value="0"/>
      </value-group>
      <value-group name="USART_TTGR__TG">
        <value name="DISABLE" caption="Disables the TX Timeguard function." value="0"/>
      </value-group>
      <value-group name="USART_FIDI__FI_DI_RATIO">
        <value name="DISABLE" caption="Baud Rate = 0" value="0"/>
      </value-group>
      <value-group name="USART_MAN__DRIFT">
        <value name="0" caption="The USART can not recover from an important clock drift" value="0"/>
        <value name="1" caption="The USART can recover from clock drift. The 16X clock mode must be enabled" value="1"/>
      </value-group>
      <value-group name="USART_MAN__RX_MPOL">
        <value name="0" caption="Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition" value="0"/>
        <value name="1" caption="Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition" value="1"/>
      </value-group>
      <value-group name="USART_MAN__RX_PL">
        <value name="0" caption="The receiver preamble pattern detection is disabled" value="0"/>
      </value-group>
      <value-group name="USART_MAN__RX_PP">
        <value name="0" caption="ALL_ONE" value="0"/>
        <value name="1" caption="ALL_ZERO" value="1"/>
        <value name="2" caption="ZERO_ONE" value="2"/>
        <value name="3" caption="ONE_ZERO" value="3"/>
      </value-group>
      <value-group name="USART_MAN__TX_MPOL">
        <value name="0" caption="Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition" value="0"/>
        <value name="1" caption="Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition" value="1"/>
      </value-group>
      <value-group name="USART_MAN__TX_PL">
        <value name="0" caption="The Transmitter Preamble pattern generation is disabled" value="0"/>
      </value-group>
      <value-group name="USART_MAN__TX_PP">
        <value name="0" caption="ALL_ONE" value="0"/>
        <value name="1" caption="ALL_ZERO" value="1"/>
        <value name="2" caption="ZERO_ONE" value="2"/>
        <value name="3" caption="ONE_ZERO" value="3"/>
      </value-group>
      <value-group name="USART_LINMR__NACT">
        <value name="PUBLISH" caption="The LIN Controller transmits the response" value="0"/>
        <value name="SUBSCRIBE" caption="The LIN Controller receives the response" value="1"/>
        <value name="IGNORE" caption="The LIN Controller doesn't transmit and doesn't receive the response" value="2"/>
      </value-group>
      <value-group name="USART_WPMR__WPEN">
        <value name="0" caption="Disables the Write Protect if WPKEY corresponds to 0x858365 ('USA' in ACII)" value="0"/>
        <value name="1" caption="Enables the Write Protect if WPKEY corresponds to 0x858365 ('USA' in ACII)" value="1"/>
      </value-group>
      <value-group name="USART_WPSR__WPV">
        <value name="0" caption="No Write Protect Violation has occurred since the last read of the WPSR register" value="0"/>
        <value name="1" caption="A Write Protect Violation has occurred since the last read of the WPSR register. If this violation is an unauthorized attempt to write a protected register, the associated violation is reported into field WPVSRC" value="1"/>
      </value-group>
    </module>
    <module name="USBC" id="I7553" version="3.1.0" caption="USB 2.0 Interface">
      <register-group name="USBC" caption="USB 2.0 Interface">
        <register name="UDCON" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000100" caption="Device General Control Register">
          <bitfield name="UADD" caption="USB Address" mask="0x7F"/>
          <bitfield name="ADDEN" caption="Address Enable" mask="0x80"/>
          <bitfield name="DETACH" caption="Detach" mask="0x100"/>
          <bitfield name="RMWKUP" caption="Remote Wake-Up" mask="0x200"/>
          <bitfield name="SPDCONF" caption="Speed configuration" mask="0xC00"/>
          <bitfield name="LS" caption="Low Speed Mode Force" mask="0x1000"/>
          <bitfield name="TSTJ" caption="Test mode J" mask="0x2000"/>
          <bitfield name="TSTK" caption="Test mode K" mask="0x4000"/>
          <bitfield name="TSTPCKT" caption="Test Packet mode" mask="0x8000"/>
          <bitfield name="OPMODE2" caption="Specific Operational mode" mask="0x10000"/>
          <bitfield name="GNAK" caption="Global NAK" mask="0x20000"/>
        </register>
